#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
module.AIAcademyLandingPage.heroku_app.ai_academy: Refreshing state... [id=ai-academy-landing-page]
module.BinhMinhIdCardAPI.heroku_app.bmidcard_api: Refreshing state... [id=binhminh-idcard-api]
module.EtronServiceAPI.heroku_app.etron_api: Refreshing state... [id=etron-service-api]
module.PersonalBlog.cloudflare_record.www_megatunger: Refreshing state... [id=b98af5802fc48600cad3132f0f56f7cd]
module.BinhMinhIdCardAPI.cloudflare_record.bmidcard_api: Refreshing state... [id=6e9cfbacb5fa5c433735b7be41fee631]
module.TestReady.cloudflare_record.www_testready: Refreshing state... [id=f6c9a4e7941a8e864238a3cceadd1cef]
module.EtronServiceAPI.cloudflare_record.etron_api: Refreshing state... [id=0f35a1045d7771138aa21b19aef7f343]
module.TestReady.cloudflare_record.testready: Refreshing state... [id=633b4e558148faceea66d6e1d5880876]
module.AIAcademyLandingPage.cloudflare_record.ai_academy: Refreshing state... [id=0a5cf682c9e6ab6f0617fed01ed0f216]
module.PersonalBlog.cloudflare_record.megatunger: Refreshing state... [id=284f02403cab8e2f8169585c87c2106d]
module.PersonalBlog.heroku_app.megatunger_blog: Refreshing state... [id=megatunger-blog]
module.TestReady.heroku_app.testready: Refreshing state... [id=testready-megatunger]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_5: Refreshing state... [id=b6758c86fbd62dec46e0ad573d11fbc4]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_2: Refreshing state... [id=a5375d4fa013a7250d1f22dd5cb23e47]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_3: Refreshing state... [id=c637dde6b0a6ca0b95a9290488db1e4f]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_1: Refreshing state... [id=3582aff137e0b139f4a62723944643ef]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_4: Refreshing state... [id=b4f9e88334045a0e35152b58812bb713]
module.uCall.heroku_app.ucall_app: Refreshing state... [id=ucall-app]
module.Edumet.cloudflare_record.edumet: Refreshing state... [id=895b92f574ab20d5099bc67e03734640]
module.SolveX.cloudflare_record.sendgrid_3: Refreshing state... [id=9f48d90cc864b70a197082384d3989af]
module.uCall.heroku_app.ucall_web: Refreshing state... [id=ucall-web]
module.SolveX.cloudflare_record.sendgrid_1: Refreshing state... [id=65c42903cf538d9a69e031304319be39]
module.Edumet.cloudflare_record.edumet_www: Refreshing state... [id=7f07a6aa62135757383a602c517435fe]
module.SolveX.cloudflare_record.solvex: Refreshing state... [id=29929e3829a14f6b3f91cdb3d8de1166]
module.SolveX.cloudflare_record.www_solvex: Refreshing state... [id=b194e7e350c45de8ebc061f9116074ac]
module.SolveX.cloudflare_record.sendgrid_2: Refreshing state... [id=39e8d43dcd2eeb7830d332b07a15e4b0]
module.SolveX.heroku_app.solvex: Refreshing state... [id=solve-x]
module.Edumet.heroku_app.edumet: Refreshing state... [id=edumet]
module.uCall.cloudflare_record.ucall_app: Refreshing state... [id=c6a1bd9db047f5d39d100bfc45ffd9ac]
module.uCall.cloudflare_record.ucall_web: Refreshing state... [id=76db510d17ea9658c938b92a5b7fbcae]
module.BinhMinhIdCardAPI.heroku_build.bmidcard_api: Refreshing state... [id=ecb8f54e-69c9-4342-b1d8-e6c6d03f0796]
module.BinhMinhIdCardAPI.heroku_domain.bmidcard_api: Refreshing state... [id=63afcda1-ddd2-480d-97fe-d6ed20816909]
module.EtronServiceAPI.heroku_domain.etron_api: Refreshing state... [id=0c7fe181-dcac-408f-8b44-84d07f9a3fda]
module.EtronServiceAPI.heroku_build.etron_api: Refreshing state... [id=3dcf0133-e420-46a6-b77f-4a07f31f3840]
module.AIAcademyLandingPage.heroku_build.ai_academy: Refreshing state... [id=f3fd68ea-b408-4591-a4da-c2914d27ab5c]
module.AIAcademyLandingPage.heroku_domain.ai_academy: Refreshing state... [id=bd9b6796-5555-4972-9f12-0d8faff05831]
module.PersonalBlog.heroku_domain.megatunger_blog: Refreshing state... [id=a69d9820-bf34-41d1-93d7-43b90cb17098]
module.TestReady.heroku_addon.redis: Refreshing state... [id=36d41931-c9a0-4941-89b3-2a1e085d695a]
module.TestReady.heroku_domain.www_testready: Refreshing state... [id=fab695c8-ee64-4530-abef-ba4ea9141f6e]
module.TestReady.heroku_build.testready: Refreshing state... [id=7f8dabbc-8eba-4464-b65d-f31f0fa43c9c]
module.PersonalBlog.heroku_domain.www_megatunger_blog: Refreshing state... [id=c24ce942-25fc-496c-9ce7-ac0e85a9cf44]
module.PersonalBlog.heroku_build.megatunger_blog: Refreshing state... [id=e908dbbc-5c5d-48cf-853f-2be1b3547987]
module.TestReady.heroku_addon.database: Refreshing state... [id=3a3dfb0f-7372-439c-9263-4906fbd57f43]
module.TestReady.heroku_domain.testready: Refreshing state... [id=4853ba53-4640-44cd-8bca-78b3e07c10e1]
module.uCall.heroku_domain.ucall_app: Refreshing state... [id=ae9d9f95-414f-4cab-ba1c-2609282ba4ad]
module.uCall.heroku_build.ucall_app: Refreshing state... [id=544fb7e7-cbf4-4846-abe6-ffa54f02b2c6]
module.uCall.heroku_build.ucall_web: Refreshing state... [id=2b69cb97-5048-4537-ae83-0c4d4e6c06c5]
module.uCall.heroku_domain.ucall_web: Refreshing state... [id=e7273a6e-5220-4c61-8e17-c9261bfcd321]
module.SolveX.heroku_addon.database: Refreshing state... [id=bd935536-c6af-44c6-a18d-77f11558a825]
module.SolveX.heroku_domain.www_solvex: Refreshing state... [id=8a2cd6b7-c848-4abf-8f72-a14db3945aa3]
module.SolveX.heroku_build.solvex: Refreshing state... [id=1fef393f-ee59-4a48-973d-acec350aa09f]
module.Edumet.heroku_domain.edumet: Refreshing state... [id=212abe17-1a8c-40d7-99c4-8207c7d59561]
module.Edumet.heroku_build.edumet: Refreshing state... [id=eaa9eb6d-ae15-44e5-a1b4-504dbd1f93b6]
module.SolveX.heroku_addon.redis: Refreshing state... [id=0636bb15-2ab9-47f3-b142-686df21a1963]
module.SolveX.heroku_domain.solvex: Refreshing state... [id=842e608b-6b96-4f49-b4ce-0c1240453fed]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.LuaLepAPI.cloudflare_record.lualep will be created
  + resource "cloudflare_record" "lualep" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "lualepapi"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "lua-lep-api.herokuapp.com"
      + zone_id     = "0783d89a07c4a168916840cd39a8bc00"
    }

  # module.LuaLepAPI.heroku_app.lualep will be created
  + resource "heroku_app" "lualep" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "lua-lep-api"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # module.LuaLepAPI.heroku_build.lualep will be created
  + resource "heroku_build" "lualep" {
      + app               = (known after apply)
      + buildpacks        = [
          + "https://github.com/heroku/heroku-buildpack-python.git",
          + "https://github.com/jonathanong/heroku-buildpack-ffmpeg-latest.git",
        ]
      + id                = (known after apply)
      + local_checksum    = (known after apply)
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + source            = {
          + "url" = "https://github.com/megatunger/Lua-Lep-Backend/archive/master.tar.gz"
        }
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)
    }

  # module.LuaLepAPI.heroku_domain.lualep will be created
  + resource "heroku_domain" "lualep" {
      + app      = (known after apply)
      + cname    = (known after apply)
      + hostname = "lualepapi.megatunger.com"
      + id       = (known after apply)
    }

  # module.SolveX.heroku_addon.database will be created
  + resource "heroku_addon" "database" {
      + app         = "solve-x"
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "heroku-postgresql:hobby-dev"
      + provider_id = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @megatunger, Action: `pull_request`*